juanmalk/FW-ContikiOS/contiki_fw_framework_m2wsns/cpu/cc26xx-cc13xx/lib/cc13xxware/inc/hw_ssi.h
/******************************************************************************
*  Filename:       hw_ssi_h
*  Revised:        2015-05-21 09:44:02 +0200 (Thu, 21 May 2015)
*  Revision:       43546
*
* Copyright (c) 2015, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_SSI_H__
#define __HW_SSI_H__

//*****************************************************************************
//
// This section defines the register offsets of
// SSI component
//
//*****************************************************************************
// Control 0
#define SSI_O_CR0                                                   0x00000000

// Control 1
#define SSI_O_CR1                                                   0x00000004

// Data
#define SSI_O_DR                                                    0x00000008

// Status
#define SSI_O_SR                                                    0x0000000C

// Clock Prescale
#define SSI_O_CPSR                                                  0x00000010

// Interrupt Mask Set and Clear
#define SSI_O_IMSC                                                  0x00000014

// Raw Interrupt Status
#define SSI_O_RIS                                                   0x00000018

// Masked Interrupt Status
#define SSI_O_MIS                                                   0x0000001C

// Interrupt Clear
#define SSI_O_ICR                                                   0x00000020

// DMA Control
#define SSI_O_DMACR                                                 0x00000024

//*****************************************************************************
//
// Register: SSI_O_CR0
//
//*****************************************************************************
// Field:  [15:8] SCR
//
// Serial clock rate:
// This is used to generate the transmit and receive bit rate of the SSI. The
// bit rate is
// (SSI's clock frequency)/((SCR+1)*CPSR.CPSDVSR).
// SCR is a value from 0-255.
#define SSI_CR0_SCR_M                                               0x0000FF00
#define SSI_CR0_SCR_S                                                        8

// Field:     [7] SPH
//
// CLKOUT phase (Motorola SPI frame format only)
// This bit selects the clock edge that captures data and enables it to change
// state. It
// has the most impact on the first bit transmitted by either permitting or not
// permitting a clock transition before the first data capture edge.
// ENUMs:
// 2ND_CLK_EDGE             Data is captured on the second clock edge
//                          transition.
// 1ST_CLK_EDGE             Data is captured on the first clock edge
//                          transition.
#define SSI_CR0_SPH                                                 0x00000080
#define SSI_CR0_SPH_BITN                                                     7
#define SSI_CR0_SPH_M                                               0x00000080
#define SSI_CR0_SPH_S                                                        7
#define SSI_CR0_SPH_2ND_CLK_EDGE                                    0x00000080
#define SSI_CR0_SPH_1ST_CLK_EDGE                                    0x00000000

// Field:     [6] SPO
//
// CLKOUT polarity (Motorola SPI frame format only)
// ENUMs:
// HIGH                     SSI produces a steady state HIGH value on the
//                          CLKOUT pin when data is not being transferred.
// LOW                      SSI produces a steady state LOW value on the
//                          CLKOUT pin when data is
//                          not being transferred.
#define SSI_CR0_SPO                                                 0x00000040
#define SSI_CR0_SPO_BITN                                                     6
#define SSI_CR0_SPO_M                                               0x00000040
#define SSI_CR0_SPO_S                                                        6
#define SSI_CR0_SPO_HIGH                                            0x00000040
#define SSI_CR0_SPO_LOW                                             0x00000000

// Field:   [5:4] FRF
//
// Frame format.
// The supported frame formats are Motorola SPI, TI synchronous serial and
// National Microwire.
// Value 0'b11 is reserved and shall not be used.
// ENUMs:
// NATIONAL_MICROWIRE       National Microwire frame format
// TI_SYNC_SERIAL           TI synchronous serial frame format
// MOTOROLA_SPI             Motorola SPI frame format
#define SSI_CR0_FRF_M                                               0x00000030
#define SSI_CR0_FRF_S                                                        4
#define SSI_CR0_FRF_NATIONAL_MICROWIRE                              0x00000020
#define SSI_CR0_FRF_TI_SYNC_SERIAL                                  0x00000010
#define SSI_CR0_FRF_MOTOROLA_SPI                                    0x00000000

// Field:   [3:0] DSS
//
// Data Size Select.
// Values 0b0000, 0b0001, 0b0010 and 0b0011 are reserved and shall not be used.
// ENUMs:
// 16_BIT                   16-bit data
// 15_BIT                   15-bit data
// 14_BIT                   14-bit data
// 13_BIT                   13-bit data
// 12_BIT                   12-bit data
// 11_BIT                   11-bit data
// 10_BIT                   10-bit data
// 9_BIT                    9-bit data
// 8_BIT                    8-bit data
// 7_BIT                    7-bit data
// 6_BIT                    6-bit data
// 5_BIT                    5-bit data
// 4_BIT                    4-bit data
#define SSI_CR0_DSS_M                                               0x0000000F
#define SSI_CR0_DSS_S                                                        0
#define SSI_CR0_DSS_16_BIT                                          0x0000000F
#define SSI_CR0_DSS_15_BIT                                          0x0000000E
#define SSI_CR0_DSS_14_BIT                                          0x0000000D
#define SSI_CR0_DSS_13_BIT                                          0x0000000C
#define SSI_CR0_DSS_12_BIT                                          0x0000000B
#define SSI_CR0_DSS_11_BIT                                          0x0000000A
#define SSI_CR0_DSS_10_BIT                                          0x00000009
#define SSI_CR0_DSS_9_BIT                                           0x00000008
#define SSI_CR0_DSS_8_BIT                                           0x00000007
#define SSI_CR0_DSS_7_BIT                                           0x00000006
#define SSI_CR0_DSS_6_BIT                                           0x00000005
#define SSI_CR0_DSS_5_BIT                                           0x00000004
#define SSI_CR0_DSS_4_BIT                                           0x00000003

//*****************************************************************************
//
// Register: SSI_O_CR1
//
//*****************************************************************************
// Field:     [3] SOD
//
// Slave-mode output disabled
// This bit is relevant only in the slave mode, MS=1. In multiple-slave
// systems, it is possible for an SSI master to broadcast a message to all
// slaves in the system while ensuring that only one slave drives data onto its
// serial output line. In such systems the RXD lines from multiple slaves could
// be tied together. To operate in such systems, this bitfield can be set if
// the SSI slave is not supposed to drive the TXD line:
//
// 0: SSI can drive the TXD output in slave mode.
// 1: SSI cannot drive the TXD output in slave mode.
#define SSI_CR1_SOD                                                 0x00000008
#define SSI_CR1_SOD_BITN                                                     3
#define SSI_CR1_SOD_M                                               0x00000008
#define SSI_CR1_SOD_S                                                        3

